cif/cart/test/resources/hybrisSetShippingMethodOnCart.json

{
  "type": "cartWsDTO",
  "appliedOrderPromotions": [
    {
      "consumedEntries": [],
      "description": "Buy over $200.00 get $20.00 discount on cart",
      "promotion": {
        "code": "order_threshold_fixed_discount_main",
        "couldFireMessages": [],
        "description": "A fixed discount is applied to the cart when the order threshold value is reached",
        "firedMessages": [],
        "promotionType": "Rule Based Promotion"
      }
    }
  ],
  "appliedProductPromotions": [],
  "appliedVouchers": [],
  "calculated": true,
  "code": "00000035",
  "deliveryAddress": {
    "country": {
      "isocode": "US",
      "name": "United States"
    },
    "defaultAddress": false,
    "firstName": "Bob",
    "formattedAddress": "Magento Pkwy, Main Street, Washington, Austin, 78758",
    "id": "8796130508823",
    "lastName": "Roll",
    "line1": "Magento Pkwy",
    "line2": "Main Street",
    "phone": "9999998899",
    "postalCode": "78758",
    "region": {
      "countryIso": "US",
      "isocode": "US-WA",
      "isocodeShort": "WA",
      "name": "Washington"
    },
    "shippingAddress": true,
    "town": "Austin",
    "visibleInAddressBook": true
  },
  "deliveryCost": {
    "currencyIso": "USD",
    "formattedValue": "$11.99",
    "priceType": "BUY",
    "value": 11.99
  },
  "deliveryItemsQuantity": 3,
  "deliveryMode": {
    "code": "standard-gross",
    "deliveryCost": {
      "currencyIso": "USD",
      "formattedValue": "$11.99",
      "priceType": "BUY",
      "value": 11.99
    },
    "description": "3-5 business days",
    "name": "Standard Delivery"
  },
  "deliveryOrderGroups": [
    {
      "entries": [
        {
          "basePrice": {
            "currencyIso": "USD",
            "formattedValue": "$168.52",
            "priceType": "BUY",
            "value": 168.52
          },
          "cancellableQuantity": 0,
          "configurationInfos": [],
          "entryNumber": 0,
          "product": {
            "availableForPickup": true,
            "averageRating": 2.4782608695652173,
            "baseOptions": [],
            "categories": [
              {
                "code": "829",
                "name": "Battery Chargers",
                "url": "/Open-Catalogue/Components/Power-Supplies/Battery-Chargers/c/829"
              },
              {
                "code": "555",
                "name": "Sony",
                "url": "/Brands/Sony/c/555"
              }
            ],
            "code": "1298094",
            "configurable": false,
            "images": [
              {
                "altText": "AC-VQ900AM",
                "format": "zoom",
                "imageType": "PRIMARY",
                "url": "/medias/?context=bWFzdGVyfGltYWdlc3wxODc5MnxpbWFnZS9qcGVnfGltYWdlcy9oNDgvaDM2Lzg3OTY4MDIyMjAwNjIuanBnfGZhYzk2MzQyODI5ZGEyNWU1NGFhMWI4NTdlZDBiY2I5ZTU4OGQ0ZjlmZTg0NDQ4YzliZGViOWZkZjZmN2ExNTE"
              },
              {
                "altText": "AC-VQ900AM",
                "format": "product",
                "imageType": "PRIMARY",
                "url": "/medias/?context=bWFzdGVyfGltYWdlc3w5NjM5fGltYWdlL2pwZWd8aW1hZ2VzL2gyNy9oYWIvODc5NjgyODU2NTUzNC5qcGd8ODdhZGYwNDE3MTA2NzZmODQxYTg3NWY5OTY4OWY4NzAwZjM3OWMwZjY3NWQxNGViNmQwMzZhNzRkODE4NjYyZg"
              },
              {
                "altText": "AC-VQ900AM",
                "format": "thumbnail",
                "imageType": "PRIMARY",
                "url": "/medias/?context=bWFzdGVyfGltYWdlc3wyMTU5fGltYWdlL2pwZWd8aW1hZ2VzL2gxMy9oMTgvODc5Njg1NDg0NTQ3MC5qcGd8MzAzOTUwNWVhODE0NGM2ZGU0OGFjNGVmMDFiOTc4MTZlMjRkZTNkZGY0MjZmYjljMDk5MDAxYjNjZWE1NGFmMw"
              },
              {
                "altText": "AC-VQ900AM",
                "format": "cartIcon",
                "imageType": "PRIMARY",
                "url": "/medias/?context=bWFzdGVyfGltYWdlc3wxNDQwfGltYWdlL2pwZWd8aW1hZ2VzL2g5MC9oZmYvODc5Njg4MTE5MDk0Mi5qcGd8YWRhOWY1NjZlZGNlM2M4NzZmYTFmOGM3ZDE3ZWNhZGM0ODJmNmIwOTllMzQ1NTY5MDM2NjlmNTNiZjMyZGMzNA"
              }
            ],
            "manufacturer": "Sony",
            "name": "AC-VQ900AM",
            "purchasable": true,
            "stock": {
              "isValueRounded": false,
              "stockLevel": 121,
              "stockLevelStatus": "inStock"
            },
            "url": "/Open-Catalogue/Components/Power-Supplies/Battery-Chargers/AC-VQ900AM/p/1298094"
          },
          "quantity": 3,
          "returnableQuantity": 0,
          "statusSummaryList": [],
          "totalPrice": {
            "currencyIso": "USD",
            "formattedValue": "$505.56",
            "priceType": "BUY",
            "value": 505.56
          },
          "updateable": true
        }
      ],
      "totalPriceWithTax": {
        "currencyIso": "USD",
        "formattedValue": "$529.63",
        "priceType": "BUY",
        "value": 529.63
      }
    }
  ],
  "entries": [
    {
      "basePrice": {
        "currencyIso": "USD",
        "formattedValue": "$168.52",
        "priceType": "BUY",
        "value": 168.52
      },
      "cancellableQuantity": 0,
      "configurationInfos": [],
      "entryNumber": 0,
      "product": {
        "availableForPickup": true,
        "averageRating": 2.4782608695652173,
        "baseOptions": [],
        "categories": [
          {
            "code": "829",
            "name": "Battery Chargers",
            "url": "/Open-Catalogue/Components/Power-Supplies/Battery-Chargers/c/829"
          },
          {
            "code": "555",
            "name": "Sony",
            "url": "/Brands/Sony/c/555"
          }
        ],
        "code": "1298094",
        "configurable": false,
        "images": [
          {
            "altText": "AC-VQ900AM",
            "format": "zoom",
            "imageType": "PRIMARY",
            "url": "/medias/?context=bWFzdGVyfGltYWdlc3wxODc5MnxpbWFnZS9qcGVnfGltYWdlcy9oNDgvaDM2Lzg3OTY4MDIyMjAwNjIuanBnfGZhYzk2MzQyODI5ZGEyNWU1NGFhMWI4NTdlZDBiY2I5ZTU4OGQ0ZjlmZTg0NDQ4YzliZGViOWZkZjZmN2ExNTE"
          },
          {
            "altText": "AC-VQ900AM",
            "format": "product",
            "imageType": "PRIMARY",
            "url": "/medias/?context=bWFzdGVyfGltYWdlc3w5NjM5fGltYWdlL2pwZWd8aW1hZ2VzL2gyNy9oYWIvODc5NjgyODU2NTUzNC5qcGd8ODdhZGYwNDE3MTA2NzZmODQxYTg3NWY5OTY4OWY4NzAwZjM3OWMwZjY3NWQxNGViNmQwMzZhNzRkODE4NjYyZg"
          },
          {
            "altText": "AC-VQ900AM",
            "format": "thumbnail",
            "imageType": "PRIMARY",
            "url": "/medias/?context=bWFzdGVyfGltYWdlc3wyMTU5fGltYWdlL2pwZWd8aW1hZ2VzL2gxMy9oMTgvODc5Njg1NDg0NTQ3MC5qcGd8MzAzOTUwNWVhODE0NGM2ZGU0OGFjNGVmMDFiOTc4MTZlMjRkZTNkZGY0MjZmYjljMDk5MDAxYjNjZWE1NGFmMw"
          },
          {
            "altText": "AC-VQ900AM",
            "format": "cartIcon",
            "imageType": "PRIMARY",
            "url": "/medias/?context=bWFzdGVyfGltYWdlc3wxNDQwfGltYWdlL2pwZWd8aW1hZ2VzL2g5MC9oZmYvODc5Njg4MTE5MDk0Mi5qcGd8YWRhOWY1NjZlZGNlM2M4NzZmYTFmOGM3ZDE3ZWNhZGM0ODJmNmIwOTllMzQ1NTY5MDM2NjlmNTNiZjMyZGMzNA"
          }
        ],
        "manufacturer": "Sony",
        "name": "AC-VQ900AM",
        "purchasable": true,
        "stock": {
          "isValueRounded": false,
          "stockLevel": 121,
          "stockLevelStatus": "inStock"
        },
        "url": "/Open-Catalogue/Components/Power-Supplies/Battery-Chargers/AC-VQ900AM/p/1298094"
      },
      "quantity": 3,
      "returnableQuantity": 0,
      "statusSummaryList": [],
      "totalPrice": {
        "currencyIso": "USD",
        "formattedValue": "$505.56",
        "priceType": "BUY",
        "value": 505.56
      },
      "updateable": true
    }
  ],
  "guid": "1b67c1dd-64b3-4de2-a7bb-5cd5084c18c3",
  "net": false,
  "orderDiscounts": {
    "currencyIso": "USD",
    "formattedValue": "$20.00",
    "priceType": "BUY",
    "value": 20
  },
  "paymentInfo": {
    "accountHolderName": "testuser",
    "billingAddress": {
      "country": {
        "isocode": "US",
        "name": "United States"
      },
      "defaultAddress": false,
      "email": "test@example.com",
      "firstName": "test",
      "formattedAddress": "Strasse 11, 70376, stuttgart, Germany",
      "id": "8796130770967",
      "lastName": "user",
      "line1": "Strasse 11",
      "postalCode": "70376",
      "region": {
        "countryIso": "US",
        "isocode": "US-WA",
        "isocodeShort": "WA",
        "name": "Washington"
      },
      "shippingAddress": false,
      "title": "Mr.",
      "titleCode": "mr",
      "town": "stuttgart",
      "visibleInAddressBook": true
    },
    "cardNumber": "************1234",
    "cardType": {
      "code": "visa",
      "name": "Visa"
    },
    "defaultPayment": false,
    "expiryMonth": "11",
    "expiryYear": "2027",
    "id": "8796094758954",
    "saved": false,
    "subscriptionId": "MockedSubscriptionID"
  },
  "pickupItemsQuantity": 0,
  "pickupOrderGroups": [],
  "productDiscounts": {
    "currencyIso": "USD",
    "formattedValue": "$0.00",
    "priceType": "BUY",
    "value": 0
  },
  "site": "electronics",
  "store": "electronics",
  "subTotal": {
    "currencyIso": "USD",
    "formattedValue": "$485.56",
    "priceType": "BUY",
    "value": 485.56
  },
  "totalDiscounts": {
    "currencyIso": "USD",
    "formattedValue": "$20.00",
    "priceType": "BUY",
    "value": 20
  },
  "totalItems": 1,
  "totalPrice": {
    "currencyIso": "USD",
    "formattedValue": "$497.55",
    "priceType": "BUY",
    "value": 497.55
  },
  "totalPriceWithTax": {
    "currencyIso": "USD",
    "formattedValue": "$497.55",
    "priceType": "BUY",
    "value": 497.55
  },
  "totalTax": {
    "currencyIso": "USD",
    "formattedValue": "$23.69",
    "priceType": "BUY",
    "value": 23.69
  },
  "user": {
    "name": "USER_FN",
    "uid": "test@example.com"
  },
  "potentialOrderPromotions": [],
  "potentialProductPromotions": [],
  "totalUnitCount": 3
}